import string
import numpy as np

delta_h = 10  # шаг измерений
hit_delta_h = 0.1
dive_delta = 0.1
delta_t = 0.001

WIDTH = 1600  # ширина игрового окна
HEIGHT = 900  # высота игрового окна
FPS = 60  # частота кадров в секунду
Button_x = 15  # х коодината
Button_y = 15  # у коодината
Start_b_size = (200, 50)  # размер кнопки
Restart_b_size = (125, 50)  # размер кнопки
Input_x = 150  # координаты текстовых полей ввода
Input_y = 100
Input_size = (100, 50)  # размер поля ввода
text_x = 275  # координаты текстовых полей вывода
text_y = 415

max_m = 10  # ограничения параметров массы
min_m = 0.1
max_v = 10  # объема
min_v = 0.001
max_h = 200000  # высоты
min_h = 100
max_delta = 1000  # шага измерений
min_delta = 1

G = 6.670 * (10 ** -11)  # Гравитационная постоянная
M = 5.972 * (10 ** 24)  # масса Земли
R = 6371 * 1000  # радиус земли
Cf = 0.47  # коэф. сопротивления сферы
sea_g = 9.814  # g на уровне моря и под водой
water_p = 1000  # плотность воды
depth = 5000


'''Таблица плотностей воздуха от высоты'''
ar_h = np.array([0, 50, 100, 200, 300, 500, 1000, 2000, 3000, 5000, 8000,
                 10000, 12000, 15000, 20000, 50000, 100000, 120000, 200001])
ar_p = np.array([1.225, 1.219, 1.213, 1.202, 1.190, 1.167, 1.112, 1.007, 0.909, 0.736, 0.526, 0.414,
                 0.312, 0.195, 0.089, 1.027 * 10 ** -3, 5.550 * 10 ** -7, 2.440 * 10 ** -8, 0])

'''таблица к сжатия воздуха'''
ar_k = np.array([0.9999, 0.9987, 0.9974, 0.995, 0.9917, 0.9901, 0.9903,
                 0.993, 1.0074, 1.0326, 1.0669, 1.1089, 1.2073, 1.3163])
ar_P = np.array([1, 5, 10, 20, 40, 60, 80, 100, 150, 200, 250, 300, 400, 500]) * 101325

white = (255, 255, 255)
black = (0, 0, 0)
red = (255, 0, 0)
green = (0, 255, 0)
blue = (0, 0, 255)

title_m = 'm(кг)'
title_V = 'V(м^3)'
title_h = 'h(м)'
title_delta_h = 'Шаг(м)'

limit = 10
white_list = []
for i in string.digits:
    white_list.append(i)
white_list.append('.')
white_list.append(',')
